; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v2 ?v10)
             (pred_2 ?v3 ?v12)
             (pred_8 ?v2 ?v12)
             (pred_7 ?v6 ?v2 )
	     (pred_10 ?v2)
             (pred_4 ?v11)
             (pred_12 ?v3)
             (pred_6 ?v12)
             (pred_11 ?v2)
             (pred_3 ?v3)
             (pred_1 ?v2)
             (pred_5 ))



(:action op_2
:parameters (?v5 ?v7 ?v4 ?v8)
:precondition (and (pred_4 ?v5) (pred_4 ?v7) (pred_12 ?v4) (pred_6 ?v8)
          (pred_9 ?v5 ?v7) (pred_2 ?v4 ?v8)
                   (pred_8 ?v7 ?v8) (pred_10 ?v5) 
                   (pred_11 ?v7) (pred_3 ?v4))
:effect (and  (pred_1 ?v7) (not (pred_11 ?v7))))


(:action op_4
:parameters (?v5 ?v9)
:precondition (and (pred_4 ?v5) (pred_4 ?v9)
               (pred_10 ?v5) (pred_9 ?v5 ?v9) (pred_1 ?v9))
:effect (and (pred_10 ?v9) (not (pred_10 ?v5))))

(:action op_5
:parameters (?v5 ?v4)
:precondition (and (pred_4 ?v5) (pred_12 ?v4) 
                  (pred_10 ?v5) (pred_7 ?v4 ?v5) (pred_5 ))
:effect (and (pred_3 ?v4)
   (not (pred_7 ?v4 ?v5)) (not (pred_5 ))))


(:action op_1
:parameters (?v5 ?v1 ?v13)
:precondition (and (pred_4 ?v5) (pred_12 ?v1) (pred_12 ?v13)
                  (pred_10 ?v5) (pred_3 ?v13) (pred_7 ?v1 ?v5))
:effect (and (pred_3 ?v1) (pred_7 ?v13 ?v5)
        (not (pred_3 ?v13)) (not (pred_7 ?v1 ?v5))))

(:action op_3
:parameters (?v5 ?v4)
:precondition (and (pred_4 ?v5) (pred_12 ?v4) 
                  (pred_10 ?v5) (pred_3 ?v4))
:effect (and (pred_5 ) (pred_7 ?v4 ?v5) (not (pred_3 ?v4)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_08 obj_12 obj_10 obj_09 obj_13 obj_01 obj_05 obj_03 obj_11
    obj_04 obj_06
    obj_02 obj_07
    )

    (:init
       (pred_5)

       (pred_4 obj_08)
       (pred_4 obj_12)
       (pred_4 obj_10)
       (pred_4 obj_09)
       (pred_4 obj_13)
       (pred_4 obj_01)
       (pred_4 obj_05)
       (pred_4 obj_03)
       (pred_4 obj_11)
       (pred_6 obj_04)
       (pred_6 obj_06)
       (pred_12 obj_02)
       (pred_12 obj_07)

       (pred_9 obj_08 obj_09)
       (pred_9 obj_08 obj_12)
       (pred_9 obj_12 obj_13)
       (pred_9 obj_12 obj_10)
       (pred_9 obj_12 obj_08)
       (pred_9 obj_10 obj_01)
       (pred_9 obj_10 obj_12)
       (pred_9 obj_09 obj_05)
       (pred_9 obj_09 obj_13)
       (pred_9 obj_09 obj_08)
       (pred_9 obj_13 obj_03)
       (pred_9 obj_13 obj_01)
       (pred_9 obj_13 obj_12)
       (pred_9 obj_13 obj_09)
       (pred_9 obj_01 obj_11)
       (pred_9 obj_01 obj_10)
       (pred_9 obj_01 obj_13)
       (pred_9 obj_05 obj_03)
       (pred_9 obj_05 obj_09)
       (pred_9 obj_03 obj_11)
       (pred_9 obj_03 obj_13)
       (pred_9 obj_03 obj_05)
       (pred_9 obj_11 obj_01)
       (pred_9 obj_11 obj_03)
       (pred_11 obj_03)
       (pred_11 obj_01)
       (pred_8  obj_03 obj_04)
       (pred_8  obj_01 obj_06)
       (pred_1 obj_08)
       (pred_1 obj_12)
       (pred_1 obj_10)
       (pred_1 obj_09)
       (pred_1 obj_13)
       (pred_1 obj_05)
       (pred_1 obj_11)

       (pred_2  obj_02 obj_04)
       (pred_2  obj_07 obj_06)
       (pred_7 obj_02 obj_13)
       (pred_7 obj_07 obj_10)
       (pred_10 obj_13)
    )

    (:goal (and
       (pred_7 obj_07 obj_09)
    ))
(:constraints
  (always (not (pred_10 obj_08)))
)
)

; plan
1. (op_4 obj_13 obj_12)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_12)
   goals met: 0 of 1
2. (op_4 obj_12 obj_10)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_10)
   goals met: 0 of 1
3. (op_5 obj_10 obj_07)
   deleted: (pred_7 obj_07 obj_10) (pred_5)
   added: (pred_3 obj_07)
   goals met: 0 of 1
4. (op_4 obj_10 obj_12)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_12)
   goals met: 0 of 1
5. (op_4 obj_12 obj_13)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_13)
   goals met: 0 of 1
6. (op_4 obj_13 obj_09)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_09)
   goals met: 0 of 1
7. (op_3 obj_09 obj_07)
   deleted: (pred_3 obj_07)
   added: (pred_5) (pred_7 obj_07 obj_09)
   goals met: 1 of 1
